Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutSizeMappings(Autodesk.Revit.DB.Document,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.Fabrication.FabricationPartSizeMap})
Sets the service swap out size mappings
document:
The document.
mappings:
The service swap out size mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.UI.UIFabricationUtils.SetServiceSwapOutPartTypeMappings(Autodesk.Revit.DB.Document,System.Collections.Generic.IDictionary`2{Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId})
Sets the service swap out part type mappings
document:
The document.
mappings:
The service swap out part type mappings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2019

Autodesk.Revit.UI.UIFabricationUtils.ExportFabricationData(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType,System.String,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
file:
full path, as returned by getFabricationExports
partIds:
the parts that will be exported.
Returns:
whether the export was successful
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationExports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationExportType,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
shows modal UI to setup all fabrication exports of the specified type.
partIds:
used if user clicks 'export now'
Returns:
returns whether the user completed the UI successfully.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.SetupFabricationReports(Autodesk.Revit.DB.Document,Autodesk.Revit.FabricationReportType,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.UI.UIFabricationUtils.PrintFabricationReports(Autodesk.Revit.DB.Document,System.Collections.Generic.IList`1{Autodesk.Revit.DB.ElementId})
Returns:
returns if any reports were printed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016